
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>02 比特币原理 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="Chapter3.html" />
    
    
    <link rel="prev" href="Chapter1.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="Chapter1.html">
            
                <a href="Chapter1.html">
            
                    
                    01 介绍
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.3" data-path="Chapter2.html">
            
                <a href="Chapter2.html">
            
                    
                    02 比特币原理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="Chapter3.html">
            
                <a href="Chapter3.html">
            
                    
                    03 密钥和地址
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="Chapter4.html">
            
                <a href="Chapter4.html">
            
                    
                    04 交易
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >02 比特币原理</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x6BD4;&#x7279;&#x5E01;&#x539F;&#x7406;">&#x6BD4;&#x7279;&#x5E01;&#x539F;&#x7406;</h1>
<p>&#x6BD4;&#x7279;&#x5E01;&#x7CFB;&#x7EDF;&#x4E0E;&#x4F20;&#x7EDF;&#x7684;&#x94F6;&#x884C;&#x548C;&#x652F;&#x4ED8;&#x7CFB;&#x7EDF;&#x4E0D;&#x540C;&#xFF0C;&#x662F;&#x57FA;&#x4E8E;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x7684;&#x4FE1;&#x4EFB;&#x3002;&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x4E2D;&#xFF0C;&#x4FE1;&#x4EFB;&#x4E0D;&#x662F;&#x901A;&#x8FC7;&#x4E2D;&#x592E;&#x6743;&#x5A01;&#x673A;&#x6784;&#x6388;&#x6743;&#x800C;&#x6765;&#xFF0C;&#x800C;&#x662F;&#x901A;&#x8FC7;&#x6BD4;&#x7279;&#x5E01;&#x7CFB;&#x7EDF;&#x4E2D;&#x4E0D;&#x540C;&#x7528;&#x6237;&#x76F8;&#x4E92;&#x4EA4;&#x4E92;&#x81EA;&#x53D1;&#x8FBE;&#x6210;&#xFF0C;&#x8FD9;&#x662F;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x4E00;&#x4E2A;&#x663E;&#x8457;&#x7279;&#x6027;&#x3002;</p>
<p><strong>&#x6CE8;&#x610F;</strong> &#x4ECE;&#x5343;&#x5206;&#x4E4B;&#x4E00;&#x6BD4;&#x7279;&#x5E01;(1&#x6BEB;&#x6BD4;&#x7279;&#x5E01;&#xFF09;&#x5230;&#x4E00;&#x4EBF;&#x5206;&#x4E4B;&#x4E00;&#x6BD4;&#x7279;&#x5E01;&#xFF08;1&#x806A;&#x6BD4;&#x7279;&#x5E01;&#xFF09;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x7F51;&#x7EDC;&#x53EF;&#x4EE5;&#x5904;&#x7406;&#x4EFB;&#x610F;&#x5C0F;&#x989D;&#x4EA4;&#x6613;&#x3002;&#x5728;&#x672C;&#x4E66;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x7528;&#x201C;&#x6BD4;&#x7279;&#x5E01;&#x201D;&#x8FD9;&#x4E2A;&#x672F;&#x8BED;&#x6765;&#x8868;&#x793A;&#x4EFB;&#x610F;&#x6570;&#x91CF;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x8D27;&#x5E01;&#xFF0C;&#x4ECE;&#x6700;&#x5C0F;&#x5355;&#x5143;&#xFF08;1&#x806A;&#xFF09;&#x5230;&#x53EF;&#x88AB;&#x6316;&#x51FA;&#x7684;&#x6240;&#x6709;&#x6BD4;&#x7279;&#x5E01;&#x603B;&#x6570; &#xFF08;21,000,000&#xFF09;&#x3002;</p>
<h2 id="&#x6BD4;&#x7279;&#x5E01;&#x4EA4;&#x6613;">&#x6BD4;&#x7279;&#x5E01;&#x4EA4;&#x6613;</h2>
<p>&#x4E00;&#x7B14;&#x4EA4;&#x6613;&#x5C31;&#x662F;&#x544A;&#x77E5;&#x5168;&#x7F51;&#xFF1A;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x6301;&#x6709;&#x8005;&#x5DF2;&#x6388;&#x6743;&#x628A;&#x5B83;&#x8F6C;&#x5E10;&#x7ED9;&#x5176;&#x4ED6;&#x4EBA;&#x3002;&#x800C;&#x65B0;&#x6301;&#x6709;&#x8005;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4EA7;&#x751F;&#x53E6;&#x4E00;&#x7B14;&#x4EA4;&#x6613;&#xFF0C;&#x8F6C;&#x8D26;&#x7ED9;&#x53E6;&#x5916;&#x7684;&#x4EBA;&#xFF0C;&#x4F9D;&#x6B64;&#x7C7B;&#x63A8;&#x5F62;&#x6210;&#x4E00;&#x6761;&#x6240;&#x6709;&#x6743;&#x7684;&#x94FE;&#x3002;</p>
<h3 id="&#x4EA4;&#x6613;&#x8F93;&#x5165;&#x8F93;&#x51FA;">&#x4EA4;&#x6613;&#x8F93;&#x5165;&#x8F93;&#x51FA;</h3>
<p>&#x4EA4;&#x6613;&#x5C31;&#x50CF;&#x590D;&#x5F0F;&#x8BB0;&#x8D26;&#x6CD5;&#x8D26;&#x7C3F;&#x4E2D;&#x7684;&#x884C;&#x3002;&#x7B80;&#x5355;&#x6765;&#x8BF4;&#xFF0C;&#x6BCF;&#x4E00;&#x7B14;&#x4EA4;&#x6613;&#x5305;&#x542B;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x201C;&#x8F93;&#x5165;&#x201D;&#xFF0C;&#x5C31;&#x50CF;&#x6BD4;&#x7279;&#x5E01;&#x8D26;&#x6237;&#x7684;&#x501F;&#x65B9;&#x3002;&#x8FD9;&#x7B14;&#x4EA4;&#x6613;&#x7684;&#x53E6;&#x4E00;&#x9762;&#xFF0C;&#x6709;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x201C;&#x8F93;&#x51FA;&#x201D;&#xFF0C;&#x5C31;&#x50CF;&#x6BD4;&#x7279;&#x5E01;&#x8D26;&#x6237;&#x7684;&#x8D37;&#x65B9;&#x3002;&#x8FD9;&#x4E9B;&#x8F93;&#x5165;&#x548C;&#x8F93;&#x51FA;&#x7684;&#x603B;&#x989D;&#xFF08;&#x501F;&#x65B9;&#x548C;&#x8D37;&#x65B9;&#xFF09;&#x4E0D;&#x9700;&#x8981;&#x76F8;&#x7B49;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x5F53;&#x8F93;&#x51FA;&#x52A0;&#x8D77;&#x6765;&#x7565;&#x5C11;&#x4E8E;&#x8F93;&#x5165;&#x6570;&#x91CF;&#x65F6;&#xFF0C;&#x4E24;&#x8005;&#x7684;&#x5DEE;&#x989D;&#x5C31;&#x4EE3;&#x8868;&#x4E86;&#x4E00;&#x7B14;&#x9690;&#x542B;&#x7684;&#x201C;&#x77FF;&#x5DE5;&#x8D39;&#x201D;&#xFF0C;&#x8FD9;&#x7B14;&#x77FF;&#x5DE5;&#x8D39;&#x7531;&#x6210;&#x529F;&#x6253;&#x5305;&#x4EA4;&#x6613;&#x5230;&#x533A;&#x5757;&#x94FE;&#x8D26;&#x7C3F;&#x7684;&#x77FF;&#x5DE5;&#x6536;&#x53D6;</p>
<h3 id="&#x4EA4;&#x6613;&#x94FE;">&#x4EA4;&#x6613;&#x94FE;</h3>
<p>Alice&#x652F;&#x4ED8;Bob&#x5496;&#x5561;&#x65F6;&#x4F7F;&#x7528;&#x4E00;&#x7B14;&#x4E4B;&#x524D;&#x7684;&#x4EA4;&#x6613;&#x4F5C;&#x4E3A;&#x8F93;&#x5165;&#x3002;</p>
<p>Alice&#x4ECE;&#x5979;&#x670B;&#x53CB;Joe&#x90A3;&#x91CC;&#x7528;&#x73B0;&#x91D1;&#x6362;&#x4E86;&#x70B9;&#x6BD4;&#x7279;&#x5E01;&#x3002;&#x90A3;&#x7B14;&#x4EA4;&#x6613;&#x521B;&#x5EFA;&#x4E86;&#x88AB;Alice&#x7684;&#x5BC6;&#x94A5;&#x9501;&#x5B9A;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x3002;&#x5728;&#x5979;&#x652F;&#x4ED8;Bob&#x5496;&#x5561;&#x5E97;&#x7684;&#x65B0;&#x4EA4;&#x6613;&#x4E2D;&#x4F7F;&#x7528;&#x4E86;&#x4E4B;&#x524D;&#x7684;&#x4EA4;&#x6613;&#x4F5C;&#x4E3A;&#x8F93;&#x5165;&#xFF0C;&#x8F93;&#x51FA;&#x662F;&#x652F;&#x4ED8;&#x5496;&#x5561;&#x7684;&#x91D1;&#x989D;&#x548C;&#x591A;&#x4F59;&#x90E8;&#x5206;&#x7684;&#x627E;&#x96F6;&#x3002;&#x4EA4;&#x6613;&#x5F62;&#x6210;&#x4E86;&#x4E00;&#x6761;&#x94FE;&#xFF0C;&#x6700;&#x8FD1;&#x4EA4;&#x6613;&#x7684;&#x8F93;&#x5165;&#x5BF9;&#x5E94;&#x4EE5;&#x524D;&#x4EA4;&#x6613;&#x7684;&#x8F93;&#x51FA;&#x3002;Alice&#x7528;&#x5BC6;&#x94A5;&#x7B7E;&#x540D;&#x89E3;&#x9501;&#x4E86;&#x4E4B;&#x524D;&#x4EA4;&#x6613;&#x7684;&#x8F93;&#x51FA;&#xFF0C;&#x4ECE;&#x800C;&#x5411;&#x6BD4;&#x7279;&#x5E01;&#x7F51;&#x7EDC;&#x8BC1;&#x660E;&#x5979;&#x62E5;&#x6709;&#x8FD9;&#x7B14;&#x94B1;&#x3002;&#x5979;&#x5C06;&#x4E70;&#x5496;&#x5561;&#x7684;&#x8FD9;&#x7B14;&#x652F;&#x4ED8;&#x5230;Bob&#x7684;&#x5730;&#x5740;&#x4E0A;&#xFF0C;&#x660E;&#x786E;&#x6307;&#x660E;&#x8981;&#x6C42;&#x662F;Bob&#x7B7E;&#x540D;&#x624D;&#x80FD;&#x6D88;&#x8D39;&#x8FD9;&#x7B14;&#x94B1;&#xFF0C;&#x5426;&#x5219;&#x5C31;&#x201C;&#x963B;&#x6B62;&#x201D;&#x90A3;&#x7B14;&#x8F93;&#x51FA;&#x3002;&#x8FD9;&#x5C31;&#x5B9E;&#x73B0;&#x4E86;&#x5728;Alice&#x548C;Bob&#x4E4B;&#x95F4;&#x4EF7;&#x503C;&#x8F6C;&#x79FB;&#x3002;&#x4E0B;&#x56FE;&#x5C55;&#x793A;&#x4E86;&#x4ECE;Joe&#x5230;Alice&#x518D;&#x5230;Bob&#x7684;&#x4EA4;&#x6613;&#x94FE;&#x3002;</p>
<p><img src="https://static.sitestack.cn/projects/MasterBitcoin2CN/mbc2_0204.png" alt="2.2 &#x6BD4;&#x7279;&#x5E01;&#x4EA4;&#x6613; - &#x56FE;2"></p>
<h3 id="&#x627E;&#x96F6;">&#x627E;&#x96F6;</h3>
<p>&#x8BB8;&#x591A;&#x6BD4;&#x7279;&#x5E01;&#x4EA4;&#x6613;&#x90FD;&#x4F1A;&#x5305;&#x62EC;&#x65B0;&#x6240;&#x6709;&#x8005;&#x7684;&#x5730;&#x5740;&#xFF08;&#x4E70;&#x65B9;&#x5730;&#x5740;&#xFF09;&#x548C;&#x5F53;&#x524D;&#x6240;&#x6709;&#x8005;&#x7684;&#x5730;&#x5740;&#xFF08;&#x79F0;&#x4E3A;&#x627E;&#x96F6;&#x5730;&#x5740;&#xFF09;&#x7684;&#x8F93;&#x51FA;&#x3002;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#x4EA4;&#x6613;&#x8F93;&#x5165;&#xFF0C;&#x5C31;&#x50CF;&#x7EB8;&#x5E01;&#x90A3;&#x6837;&#x80FD;&#x591F;&#x4E0D;&#x80FD;&#x88AB;&#x518D;&#x5206;&#x5272;&#x3002;&#x5982;&#x679C;&#x60A8;&#x5728;&#x5546;&#x5E97;&#x8D2D;&#x4E70;&#x4E86;5&#x7F8E;&#x5143;&#x7684;&#x5546;&#x54C1;&#xFF0C;&#x4F46;&#x662F;&#x4F7F;&#x7528;20&#x7F8E;&#x5143;&#x7684;&#x7F8E;&#x91D1;&#x6765;&#x652F;&#x4ED8;&#x5546;&#x54C1;&#xFF0C;&#x4F1A;&#x6536;&#x5230;15&#x7F8E;&#x5143;&#x7684;&#x627E;&#x96F6;&#x3002;&#x76F8;&#x540C;&#x7684;&#x6982;&#x5FF5;&#x9002;&#x7528;&#x4E8E;&#x6BD4;&#x7279;&#x5E01;&#x4EA4;&#x6613;&#x8F93;&#x5165;&#x3002;&#x5982;&#x679C;&#x60A8;&#x8D2D;&#x4E70;&#x4E86;&#x4E00;&#x4E2A;&#x4EF7;&#x683C;&#x4E3A;5&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x5546;&#x54C1;&#xFF0C;&#x4F46;&#x662F;&#x4F60;&#x7684;&#x8F93;&#x5165;&#x4E2D;&#x53EA;&#x6709;20&#x6BD4;&#x7279;&#x5E01;&#x8FD9;&#x4E00;&#x9879;&#xFF0C;&#x90A3;&#x4E48;&#x60A8;&#x9700;&#x8981;&#x4EA7;&#x751F;&#x4E24;&#x4E2A;&#x8F93;&#x51FA;&#xFF1A;&#x4E00;&#x4E2A;5&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x8F93;&#x51FA;&#x53D1;&#x9001;&#x7ED9;&#x5E97;&#x4E3B;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;15&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x8F93;&#x51FA;&#x8FD4;&#x56DE;&#x81EA;&#x5DF1;&#x4F5C;&#x4E3A;&#x627E;&#x96F6;&#xFF08;&#x51CF;&#x53BB;&#x4EFB;&#x4F55;&#x9002;&#x7528;&#x7684;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#xFF09;&#x3002;&#x91CD;&#x8981;&#x7684;&#x662F;&#xFF0C;&#x51FA;&#x4E8E;&#x9690;&#x79C1;&#x7684;&#x539F;&#x56E0;&#xFF0C;&#x627E;&#x96F6;&#x5730;&#x5740;&#x4E0D;&#x5FC5;&#x4E0E;&#x8F93;&#x5165;&#x65F6;&#x63D0;&#x4F9B;&#x7684;&#x5730;&#x5740;&#x76F8;&#x540C;&#xFF0C;&#x901A;&#x5E38;&#x662F;&#x6240;&#x6709;&#x8005;&#x94B1;&#x5305;&#x4E2D;&#x7684;&#x65B0;&#x5730;&#x5740;&#x3002;</p>
<p>&#x4E0D;&#x540C;&#x7684;&#x94B1;&#x5305;&#x53EF;&#x4EE5;&#x5728;&#x5408;&#x5E76;&#x6240;&#x6709;&#x8F93;&#x5165;&#xFF0C;&#x7528;&#x6765;&#x5339;&#x914D;&#x81EA;&#x5DF1;&#x7684;&#x4ED8;&#x6B3E;&#x91D1;&#x989D;&#x65F6;&#x4F7F;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x7B56;&#x7565;&#x3002;&#x5B83;&#x4EEC;&#x53EF;&#x80FD;&#x4F1A;&#x805A;&#x5408;&#x8BB8;&#x591A;&#x5C0F;&#x8F93;&#x5165;&#xFF0C;&#x6216;&#x8005;&#x4F7F;&#x7528;&#x7B49;&#x4E8E;&#x6216;&#x5927;&#x4E8E;&#x6240;&#x9700;&#x4ED8;&#x6B3E;&#x7684;&#x8F93;&#x5165;&#x3002;&#x9664;&#x975E;&#x94B1;&#x5305;&#x4E2D;&#x7684;&#x8F93;&#x5165;&#xFF0C;&#x521A;&#x597D;&#x6C47;&#x603B;&#x8D77;&#x6765;&#x4E0E;&#x6240;&#x9700;&#x4ED8;&#x6B3E;&#xFF08;&#x52A0;&#x4E0A;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#xFF09;&#x5B8C;&#x5168;&#x76F8;&#x7B49;&#xFF0C;&#x5426;&#x5219;&#x94B1;&#x5305;&#x4E00;&#x5B9A;&#x4F1A;&#x4EA7;&#x751F;&#x4E00;&#x4E9B;&#x627E;&#x96F6;&#x3002;&#x8FD9;&#x4E0E;&#x4EBA;&#x4EEC;&#x5982;&#x4F55;&#x5904;&#x7406;&#x73B0;&#x91D1;&#x975E;&#x5E38;&#x76F8;&#x4F3C;&#x3002;&#x5982;&#x679C;&#x4F60;&#x603B;&#x662F;&#x7528;&#x94B1;&#x5305;&#x4E2D;&#x7684;&#x6700;&#x5927;&#x9762;&#x989D;&#x652F;&#x4ED8;&#x65F6;&#xFF0C;&#x90A3;&#x4E48;&#x94B1;&#x5305;&#x4E2D;&#x7684;&#x96F6;&#x94B1;&#x5C31;&#x4F1A;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x3002;&#x5982;&#x679C;&#x4F60;&#x53EA;&#x4F7F;&#x7528;&#x96F6;&#x94B1;&#xFF0C;&#x6574;&#x94B1;&#x5C31;&#x4F1A;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x3002;&#x4EBA;&#x4EEC;&#x603B;&#x662F;&#x65E0;&#x610F;&#x8BC6;&#x5730;&#x5728;&#x8FD9;&#x4E24;&#x4E2A;&#x6781;&#x7AEF;&#x4E4B;&#x95F4;&#x627E;&#x5230;&#x5E73;&#x8861;&#xFF0C;&#x800C;&#x6BD4;&#x7279;&#x5E01;&#x94B1;&#x5305;&#x5F00;&#x53D1;&#x5546;&#x4E5F;&#x529B;&#x56FE;&#x5B9E;&#x73B0;&#x8FD9;&#x79CD;&#x5E73;&#x8861;&#x3002;</p>
<p>&#x603B;&#x7684;&#x6765;&#x8BB2;&#xFF0C;&#x4EA4;&#x6613;&#x662F;&#x5C06;&#x94B1;&#x4ECE;&#x4EA4;&#x6613;&#x8F93;&#x5165;&#x79FB;&#x81F3;&#x8F93;&#x51FA;&#x3002;&#x8F93;&#x5165;&#x901A;&#x5E38;&#x662F;&#x524D;&#x4E00;&#x7B14;&#x4EA4;&#x6613;&#x7684;&#x8F93;&#x51FA;&#x7684;&#x5F15;&#x7528;&#xFF0C;&#x8868;&#x793A;&#x4EF7;&#x503C;&#x4ECE;&#x4F55;&#x800C;&#x6765;&#x3002;&#x4EA4;&#x6613;&#x8F93;&#x51FA;&#x5C06;&#x7EA6;&#x5B9A;&#x91D1;&#x989D;&#x53D1;&#x9001;&#x5230;&#x65B0;&#x7684;&#x6240;&#x6709;&#x8005;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#xFF0C;&#x5E76;&#x5C06;&#x627E;&#x96F6;&#x8F93;&#x51FA;&#x8FD4;&#x56DE;&#x539F;&#x6765;&#x6240;&#x6709;&#x8005;&#x7684;&#x5730;&#x5740;&#x3002; &#x4E00;&#x7B14;&#x4EA4;&#x6613;&#x7684;&#x8F93;&#x51FA;&#x53EF;&#x4EE5;&#x88AB;&#x5F53;&#x505A;&#x53E6;&#x4E00;&#x7B14;&#x65B0;&#x4EA4;&#x6613;&#x7684;&#x8F93;&#x5165;&#xFF0C;&#x8FD9;&#x6837;&#x968F;&#x7740;&#x94B1;&#x4ECE;&#x4E00;&#x4E2A;&#x5730;&#x5740;&#x88AB;&#x79FB;&#x52A8;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x5730;&#x5740;&#xFF0C;&#x5C31;&#x5F62;&#x6210;&#x4E86;&#x4E00;&#x6761;&#x6240;&#x6709;&#x6743;&#x94FE;</p>
<h2 id="&#x6BD4;&#x7279;&#x5E01;&#x6316;&#x77FF;">&#x6BD4;&#x7279;&#x5E01;&#x6316;&#x77FF;</h2>
<p>&#x4E00;&#x7B14;&#x4EA4;&#x6613;&#x5427;&#x53EA;&#x6709;&#x88AB;&#x6316;&#x77FF;&#x8282;&#x70B9;&#x9A8C;&#x8BC1;&#x4E14;&#x52A0;&#x5230;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x4E2D;&#x4E4B;&#x540E;&#xFF0C;&#x8FD9;&#x4E2A;&#x4EA4;&#x6613;&#x624D;&#x4F1A;&#x6210;&#x4E3A;&#x8FD9;&#x4E2A;&#x5171;&#x4EAB;&#x8D26;&#x7C3F;&#xFF08;&#x533A;&#x5757;&#x94FE;&#xFF09;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002;&#x5173;&#x4E8E;&#x6316;&#x77FF;&#x7684;&#x8BE6;&#x7EC6;&#x63CF;&#x8FF0;&#x8BF7;&#x89C1;&#x7B2C;10&#x7AE0;&#x3002;&#x6BD4;&#x7279;&#x5E01;&#x7CFB;&#x7EDF;&#x7684;&#x4FE1;&#x4EFB;&#x662F;&#x5EFA;&#x7ACB;&#x5728;&#x8BA1;&#x7B97;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#x7684;&#x3002;&#x4EA4;&#x6613;&#x88AB;&#x6253;&#x5305;&#x5728;&#x4E00;&#x8D77;&#x653E;&#x8FDB;&#x533A;&#x5757;&#x4E2D;&#x65F6;&#x9700;&#x8981;&#x6781;&#x5927;&#x7684;&#x8BA1;&#x7B97;&#x91CF;&#x6765;&#x8BC1;&#x660E;&#xFF0C;&#x4F46;&#x662F;&#x9A8C;&#x8BC1;&#x8FD9;&#x4E2A;&#x8BC1;&#x660E;&#x53EA;&#x9700;&#x5C11;&#x91CF;&#x8BA1;&#x7B97;&#x5C31;&#x53EF;&#x4EE5;&#x3002;</p>
<p>&#x6316;&#x77FF;&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x7CFB;&#x7EDF;&#x4E2D;&#x6709;&#x4E24;&#x4E2A;&#x91CD;&#x8981;&#x4F5C;&#x7528;&#xFF1A;</p>
<p>&#x25B7; &#x6316;&#x77FF;&#x8282;&#x70B9;&#x4F9D;&#x636E;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x5171;&#x8BC6;&#x89C4;&#x5219;&#x9A8C;&#x8BC1;&#x6240;&#x6709;&#x4EA4;&#x6613;&#x3002; &#x56E0;&#x6B64;&#xFF0C;&#x6316;&#x77FF;&#x8FC7;&#x7A0B;&#x4F1A;&#x62D2;&#x7EDD;&#x65E0;&#x6548;&#x6216;&#x4E0D;&#x5408;&#x89C4;&#x4EA4;&#x6613;&#xFF0C;&#x4EE5;&#x6B64;&#x4FDD;&#x969C;&#x6BD4;&#x7279;&#x5E01;&#x4EA4;&#x6613;&#x7684;&#x5B89;&#x5168;&#x6027;&#x3002;</p>
<p>&#x25B7; &#x6316;&#x77FF;&#x5728;&#x6784;&#x5EFA;&#x533A;&#x5757;&#x65F6;&#x4F1A;&#x521B;&#x9020;&#x65B0;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#xFF0C;&#x5C31;&#x50CF;&#x4E2D;&#x592E;&#x94F6;&#x884C;&#x53D1;&#x884C;&#x65B0;&#x7684;&#x7EB8;&#x5E01;&#x4E00;&#x6837;&#x3002;&#x6BCF;&#x4E2A;&#x533A;&#x5757;&#x521B;&#x9020;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x6570;&#x91CF;&#x662F;&#x56FA;&#x5B9A;&#x7684;&#xFF0C;&#x5E76;&#x4E14;&#x4F1A;&#x9010;&#x6E10;&#x51CF;&#x5C11;&#x3002;</p>
<p>&#x6316;&#x77FF;&#x5728;&#x6210;&#x672C;&#x548C;&#x62A5;&#x916C;&#x4E4B;&#x95F4;&#x53D6;&#x5F97;&#x4E86;&#x826F;&#x597D;&#x7684;&#x5E73;&#x8861;&#x3002; &#x6316;&#x77FF;&#x8017;&#x8D39;&#x7535;&#x529B;&#x6765;&#x89E3;&#x51B3;&#x6570;&#x5B66;&#x95EE;&#x9898;&#x3002; &#x77FF;&#x5DE5;&#x6316;&#x77FF;&#x6210;&#x529F;&#x5C06;&#x4F1A;&#x83B7;&#x5F97;&#x65B0;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x548C;&#x4EA4;&#x6613;&#x8D39;&#x4F5C;&#x4E3A;&#x5956;&#x52B1;&#x3002; &#x4F46;&#x662F;&#xFF0C;&#x53EA;&#x6709;&#x5176;&#x4ED6;&#x77FF;&#x5DE5;&#x6B63;&#x786E;&#x9A8C;&#x8BC1;&#x4E86;&#x6240;&#x6709;&#x7684;&#x4EA4;&#x6613;&#xFF0C;&#x7B26;&#x5408;&#x5171;&#x8BC6;&#x89C4;&#x5219;&#x7684;&#x8981;&#x6C42;&#xFF0C;&#x624D;&#x80FD;&#x62FF;&#x5230;&#x5956;&#x52B1;&#x3002; &#x8FD9;&#x79CD;&#x5FAE;&#x5999;&#x7684;&#x5E73;&#x8861;&#x4E3A;&#x6CA1;&#x6709;&#x4E2D;&#x592E;&#x6743;&#x5A01;&#x673A;&#x6784;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x63D0;&#x4F9B;&#x5B89;&#x5168;&#x4FDD;&#x969C;&#x3002;</p>
<p>&#x63CF;&#x8FF0;&#x6316;&#x77FF;&#x6700;&#x597D;&#x5C06;&#x5176;&#x7C7B;&#x6BD4;&#x4E3A;&#x4E00;&#x4E2A;&#x5DE8;&#x5927;&#x7684;&#x591A;&#x4EBA;&#x6570;&#x72EC;&#x6E38;&#x620F;&#x3002;&#x4E00;&#x65E6;&#x6709;&#x4EBA;&#x53D1;&#x73B0;&#x6B63;&#x89E3;&#x4E4B;&#x540E;&#xFF0C;&#x8FD9;&#x4E2A;&#x6570;&#x72EC;&#x6E38;&#x620F;&#x4F1A;&#x81EA;&#x52A8;&#x91CD;&#x7F6E;&#xFF0C;&#x5E76;&#x8C03;&#x6574;&#x96BE;&#x5EA6;&#xFF0C;&#x4F7F;&#x5F97;&#x6E38;&#x620F;&#x6BCF;&#x6B21;&#x90FD;&#x9700;&#x8981;&#x5927;&#x7EA6;10&#x5206;&#x949F;&#x624D;&#x80FD;&#x89E3;&#x51B3;&#x3002;&#x60F3;&#x8C61;&#x4E00;&#x4E2A;&#x6709;&#x597D;&#x51E0;&#x5343;&#x884C;&#x548C;&#x5217;&#x7684;&#x5927;&#x578B;&#x6570;&#x72EC;&#x6E38;&#x620F;&#x3002;&#x5982;&#x679C;&#x7ED9;&#x4F60;&#x4E00;&#x4E2A;&#x5DF2;&#x7ECF;&#x5B8C;&#x6210;&#x7684;&#x6570;&#x72EC;&#x8C1C;&#x5E95;&#xFF0C; &#x4F60;&#x53EF;&#x4EE5;&#x5F88;&#x5FEB;&#x5730;&#x9A8C;&#x8BC1;&#x5B83;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5982;&#x679C;&#x8FD9;&#x4E2A;&#x6570;&#x72EC;&#x53EA;&#x6709;&#x51E0;&#x4E2A;&#x65B9;&#x683C;&#x91CC;&#x6709;&#x6570;&#x5B57;&#x5176;&#x4F59;&#x65B9;&#x683C;&#x90FD;&#x4E3A;&#x7A7A;&#xFF0C;&#x5C31;&#x4F1A;&#x82B1;&#x8D39;&#x975E;&#x5E38;&#x957F;&#x7684;&#x65F6;&#x95F4;&#x624D;&#x80FD;&#x89E3;&#x51B3;&#x3002;&#x8FD9;&#x4E2A;&#x6570;&#x72EC;&#x6E38;&#x620F;&#x7684;&#x56F0;&#x96BE;&#x5EA6;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x6539;&#x53D8;&#x5176;&#x5927;&#x5C0F;&#xFF08;&#x66F4;&#x591A;&#x6216;&#x66F4;&#x5C11;&#x884C;&#x5217;&#xFF09;&#x6765;&#x8C03;&#x6574;&#xFF0C;&#x4F46;&#x5373;&#x4F7F;&#x975E;&#x5E38;&#x5927;&#x65F6;&#x9A8C;&#x8BC1;&#x7ED3;&#x679C;&#x4E5F;&#x662F;&#x76F8;&#x5F53;&#x5BB9;&#x6613;&#x7684;&#x3002;&#x6BD4;&#x7279;&#x5E01;&#x4E2D;&#x7684; &#x201C;&#x8C1C;&#x9898;&#x201D; &#x662F;&#x57FA;&#x4E8E;&#x54C8;&#x5E0C;&#x52A0;&#x5BC6;&#x7B97;&#x6CD5;&#x7684;&#xFF0C;&#x6709;&#x7C7B;&#x4F3C;&#x7684;&#x7279;&#x70B9;&#xFF1A;&#x4E0D;&#x5BF9;&#x79F0;&#xFF0C;&#x89E3;&#x8D77;&#x6765;&#x56F0;&#x96BE;&#x800C;&#x9A8C;&#x8BC1;&#x5F88;&#x5BB9;&#x6613;&#xFF0C;&#x800C;&#x4E14;&#x5B83;&#x7684;&#x56F0;&#x96BE;&#x5EA6;&#x53EF;&#x4EE5;&#x8C03;&#x6574;&#x3002;</p>
<p>&#x5BFB;&#x627E;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x7684;&#x4EA4;&#x6613;&#x6B63;&#x89E3;&#xFF0C;&#x4E5F;&#x88AB;&#x79F0;&#x4E3A;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#xFF0C;&#x6574;&#x4E2A;&#x7F51;&#x7EDC;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x6BCF;&#x79D2;&#x4EBF;&#x4E07;&#x6B21;&#x54C8;&#x5E0C;&#x8BA1;&#x7B97;&#x3002;&#x8FD9;&#x4E2A;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#x7B97;&#x6CD5;&#x6307;&#x7684;&#x7528;SHA256&#x52A0;&#x5BC6;&#x7B97;&#x6CD5;&#x91CD;&#x590D;&#x4E0D;&#x65AD;&#x5BF9;&#x533A;&#x5757;&#x5934;&#x548C;&#x4E00;&#x4E2A;&#x968F;&#x673A;&#x6570;&#x5B57;&#x8FDB;&#x884C;&#x54C8;&#x5E0C;&#x8BA1;&#x7B97;&#xFF0C;&#x76F4;&#x5230;&#x51FA;&#x73B0;&#x4E00;&#x4E2A;&#x548C;&#x9884;&#x8BBE;&#x76EE;&#x6807;&#x503C;&#x76F8;&#x5339;&#x914D;&#x7684;&#x89E3;&#x3002;&#x7B2C;&#x4E00;&#x4E2A;&#x627E;&#x5230;&#x8FD9;&#x4E2A;&#x89E3;&#x7684;&#x77FF;&#x5DE5;&#x5C31;&#x662F;&#x8D62;&#x5F97;&#x8FD9;&#x5C40;&#x7ADE;&#x8D5B;&#xFF0C;&#x5E76;&#x4F1A;&#x5C06;&#x6B64;&#x533A;&#x5757;&#x53D1;&#x5E03;&#x5230;&#x533A;&#x5757;&#x94FE;&#x4E2D;&#x3002;</p>
<h3 id="&#x533A;&#x5757;&#x4E2D;&#x7684;&#x6316;&#x77FF;&#x4EA4;&#x6613;&#x8BB0;&#x5F55;">&#x533A;&#x5757;&#x4E2D;&#x7684;&#x6316;&#x77FF;&#x4EA4;&#x6613;&#x8BB0;&#x5F55;</h3>
<p>&#x65B0;&#x4EA4;&#x6613;&#x4E0D;&#x65AD;&#x5730;&#x4ECE;&#x7528;&#x6237;&#x94B1;&#x5305;&#x548C;&#x5176;&#x4ED6;&#x5E94;&#x7528;&#x6D41;&#x5165;&#x6BD4;&#x7279;&#x5E01;&#x7F51;&#x7EDC;&#x3002;&#x5F53;&#x6BD4;&#x7279;&#x5E01;&#x7F51;&#x7EDC;&#x4E0A;&#x7684;&#x8282;&#x70B9;&#x770B;&#x5230;&#x8FD9;&#x4E9B;&#x4EA4;&#x6613;&#x65F6;&#xFF0C;&#x4F1A;&#x5148;&#x5C06;&#x5B83;&#x4EEC;&#x653E;&#x5230;&#x8282;&#x70B9;&#x81EA;&#x884C;&#x7EF4;&#x62A4;&#x7684;&#x4E00;&#x4E2A;&#x4E34;&#x65F6;&#x7684;&#x672A;&#x7ECF;&#x9A8C;&#x8BC1;&#x7684;&#x4EA4;&#x6613;&#x6C60;&#x4E2D;&#x3002;&#x5F53;&#x77FF;&#x5DE5;&#x6784;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x533A;&#x5757;&#x65F6;&#xFF0C; &#x4F1A;&#x5C06;&#x8FD9;&#x4E9B;&#x4EA4;&#x6613;&#x4ECE;&#x8FD9;&#x4E2A;&#x4EA4;&#x6613;&#x6C60;&#x4E2D;&#x62FF;&#x51FA;&#x6765;&#x653E;&#x5230;&#x4E00;&#x4E2A;&#x65B0;&#x533A;&#x5757;&#x4E2D;&#xFF0C;&#x7136;&#x540E;&#x901A;&#x8FC7;&#x5C1D;&#x8BD5;&#x89E3;&#x51B3;&#x4E00;&#x4E2A;&#x96BE;&#x9898;&#xFF08;&#x4E5F;&#x53EB;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#xFF09;&#x4EE5;&#x8BC1;&#x660E;&#x8FD9;&#x4E2A;&#x65B0;&#x533A;&#x5757;&#x7684;&#x6709;&#x6548;&#x6027;&#x3002;</p>
<p>&#x8FD9;&#x4E9B;&#x4EA4;&#x6613;&#x88AB;&#x52A0;&#x8FDB;&#x65B0;&#x533A;&#x5757;&#x65F6;&#xFF0C;&#x4EE5;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x548C;&#x5176;&#x5B83;&#x7684;&#x4E00;&#x4E9B;&#x89C4;&#x5219;&#x8FDB;&#x884C;&#x6392;&#x5E8F;&#x3002;&#x77FF;&#x5DE5;&#x4E00;&#x65E6;&#x4ECE;&#x7F51;&#x7EDC;&#x4E0A;&#x6536;&#x5230;&#x4E00;&#x4E2A;&#x65B0;&#x533A;&#x5757;&#xFF0C; &#x5C31;&#x77E5;&#x9053;&#x81EA;&#x5DF1;&#x5728;&#x8FD9;&#x4E2A;&#x533A;&#x5757;&#x4E0A;&#x7684;&#x89E3;&#x9898;&#x7ADE;&#x8D5B;&#x5DF2;&#x7ECF;&#x8F93;&#x6389;&#x4E86;&#xFF0C;&#x7136;&#x540E;&#x9A6C;&#x4E0A;&#x5F00;&#x59CB;&#x4E0B;&#x4E00;&#x4E2A;&#x65B0;&#x533A;&#x5757;&#x7684;&#x6316;&#x77FF;&#x3002;&#x5B83;&#x4F1A;&#x7ACB;&#x523B;&#x5C06;&#x4E00;&#x4E9B;&#x4EA4;&#x6613;&#x548C;&#x6700;&#x65B0;&#x90A3;&#x4E2A;&#x533A;&#x5757;&#x7684;&#x6570;&#x5B57;&#x6307;&#x7EB9;&#x653E;&#x5728;&#x4E00;&#x8D77;&#x5F00;&#x59CB;&#x6784;&#x5EFA;&#x4E0B;&#x4E00;&#x4E2A;&#x65B0;&#x533A;&#x5757;&#xFF0C;&#x5E76;&#x5F00;&#x59CB;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#x8BA1;&#x7B97;&#x3002;&#x6BCF;&#x4E2A;&#x77FF;&#x5DE5;&#x4F1A;&#x5728;&#x4ED6;&#x7684;&#x533A;&#x5757;&#x4E2D;&#x5305;&#x542B;&#x4E00;&#x4E2A;&#x7279;&#x6B8A;&#x7684;&#x4EA4;&#x6613;&#xFF0C;&#x5C06;&#x65B0;&#x751F;&#x6210;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#xFF08;&#x5F53;&#x524D;&#x6BCF;&#x533A;&#x5757;&#x4E3A;12.5&#x6BD4;&#x7279;&#x5E01;&#xFF09;&#x4F5C;&#x4E3A;&#x77FF;&#x5DE5;&#x8D39;&#x652F;&#x4ED8;&#x5230;&#x4ED6;&#x81EA;&#x5DF1;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#xFF0C;&#x518D;&#x52A0;&#x4E0A;&#x5757;&#x4E2D;&#x6240;&#x6709;&#x4EA4;&#x6613;&#x7684;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x7684;&#x603B;&#x548C;&#x4F5C;&#x4E3A;&#x81EA;&#x5DF1;&#x7684;&#x62A5;&#x916C;&#x3002;&#x5982;&#x679C;&#x4ED6;&#x627E;&#x5230;&#x4E86;&#x4F7F;&#x5F97;&#x65B0;&#x533A;&#x5757;&#x6709;&#x6548;&#x7684;&#x89E3;&#x6CD5;&#xFF0C;&#x4ED6;&#x5C31;&#x4F1A;&#x5F97;&#x5230;&#x8FD9;&#x7B14;&#x62A5;&#x916C;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x4E2A;&#x65B0;&#x533A;&#x5757;&#x88AB;&#x52A0;&#x5165;&#x5230;&#x4E86;&#x533A;&#x5757;&#x94FE;&#x603B;&#x8D26;&#x4E2D;&#xFF0C;&#x4ED6;&#x6DFB;&#x52A0;&#x7684;&#x8FD9;&#x7B14;&#x62A5;&#x916C;&#x4EA4;&#x6613;&#x4E5F;&#x4F1A;&#x53D8;&#x6210;&#x53EF;&#x6D88;&#x8D39;&#x7684;&#x3002; &#x53C2;&#x4E0E;&#x77FF;&#x6C60;&#x6316;&#x77FF;&#x7684;Jing&#x8BBE;&#x7F6E;&#x4E86;&#x4ED6;&#x7684;&#x8F6F;&#x4EF6;&#xFF0C;&#x6784;&#x5EFA;&#x65B0;&#x533A;&#x5757;&#x65F6;&#x4F1A;&#x5C06;&#x62A5;&#x916C;&#x5730;&#x5740;&#x8BBE;&#x4E3A;&#x6574;&#x4E2A;&#x77FF;&#x6C60;&#x7684;&#x5730;&#x5740;&#x3002;&#x7136;&#x540E;&#x6839;&#x636E;&#x5404;&#x81EA;&#x4E0A;&#x4E00;&#x8F6E;&#x8D21;&#x732E;&#x7684;&#x5DE5;&#x4F5C;&#x91CF;&#x5C06;&#x6240;&#x5F97;&#x7684;&#x62A5;&#x916C;&#x5206;&#x7ED9;Jing&#x548C;&#x5176;&#x4ED6;&#x53C2;&#x4E0E;&#x77FF;&#x6C60;&#x6316;&#x77FF;&#x7684;&#x77FF;&#x5DE5;&#x3002;</p>
<p><strong>&#x533A;&#x5757;&#x4E3A;&#x4EC0;&#x4E48;&#x4E0D;&#x5BB9;&#x6613;&#x64A4;&#x9500;&#xFF1F;&#xFF08;&#x5373;&#x6BD4;&#x7279;&#x5E01;&#x4E3A;&#x4EC0;&#x4E48;&#x5F88;&#x5B89;&#x5168;&#xFF09;</strong></p>
<p>&#x4E00;&#x4E2A;&#x65B0;&#x8BDE;&#x751F;&#x7684;&#x533A;&#x5757;&#xFF0C;&#x50CF;&#x94FE;&#x5B50;&#x4E00;&#x6837;&#x4E00;&#x4E2A;&#x8FDE;&#x7740;&#x4E00;&#x4E2A;&#xFF08;&#x533A;&#x5757;&#x94FE;&#xFF09;&#xFF0C;&#x4E00;&#x76F4;&#x8FDE;&#x5230;0&#x53F7;&#x533A;&#x5757;&#xFF0C;&#x5373;&#x521B;&#x4E16;&#x533A;&#x5757;&#x3002;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x53D8;&#x957F;&#xFF0C;&#x8FD9;&#x4E2A;&#x533A;&#x5757;&#x94FE;&#x7684;&#x9AD8;&#x5EA6;&#x4E5F;&#x968F;&#x4E4B;&#x589E;&#x957F;&#xFF0C;&#x6BCF;&#x4E2A;&#x533A;&#x5757;&#x548C;&#x6574;&#x4E2A;&#x533A;&#x5757;&#x94FE;&#x7684;&#x8BA1;&#x7B97;&#x96BE;&#x5EA6;&#x4E5F;&#x968F;&#x4E4B;&#x589E;&#x52A0;&#x3002;&#x6309;&#x60EF;&#x4F8B;&#x6765;&#x8BF4;&#xFF0C;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x83B7;&#x5F97;&#x516D;&#x6B21;&#x4EE5;&#x4E0A;&#x201C;&#x786E;&#x8BA4;&#x201D;&#x65F6;&#x5C31;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x4E0D;&#x53EF;&#x64A4;&#x9500;&#x7684;&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;&#x8981;&#x64A4;&#x9500;&#x548C;&#x91CD;&#x5EFA;&#x516D;&#x4E2A;&#x533A;&#x5757;&#x9700;&#x8981;&#x5DE8;&#x91CF;&#x7684;&#x8BA1;&#x7B97;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="Chapter1.html" class="navigation navigation-prev " aria-label="Previous page: 01 介绍">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="Chapter3.html" class="navigation navigation-next " aria-label="Next page: 03 密钥和地址">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"02 比特币原理","level":"1.3","depth":1,"next":{"title":"03 密钥和地址","level":"1.4","depth":1,"path":"Chapter3.md","ref":"Chapter3.md","articles":[]},"previous":{"title":"01 介绍","level":"1.2","depth":1,"path":"Chapter1.md","ref":"Chapter1.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"Chapter2.md","mtime":"2020-12-27T12:32:02.101Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-01-03T14:40:40.583Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

